%%系统名义参数
l1n = 0.1;
l2n = 0.1;
L = 0.2;
m1n = 0.01;
m2n = 0.01;
m3n = 0.2;
Mn = 1.25;
g = 9.8;

%%系统名义系数计算
K12n = 3/2 *(-2*m1n-4*m2n-4*m3n)*g/((-4*m1n-3*m2n-12*m3n)*l1n);
K13n = 9/2 * (m2n*g)/((-4*m1n-3*m2n-12*m3n)*l1n);
K17n = 3/2*(-2*m1n-m2n-4*m3n)/((-4*m1n-3*m2n-12*m3n)*l1n);
K22n = 2*g*(m1n+2*(m2n+m3n))/(4*m2n*l2n-16/9*l2n*(m1n+3*(m2n+m3n)));
K23n = -4/3*g*(m1n+3*(m2n+m3n))/(4*m2n*l2n-16/9*l2n*(m1n+3*(m2n+m3n)));
K27n = (2*(m1n+2*(m2n+m3n))-4/3*(m1n+3*(m2n+m3n)))/(4*m2n*l2n-16/9*l2n*(m1n+3*(m2n+m3n)));

%%系统实际参数
l1 = 0.15;
l2 = 0.12;
L = 0.2;
m1 = 0.01;
m2 = 0.01;
m3 = 0.2;
M = 1.25;
g = 9.8;

%%系统实际系数计算
K12 = 3/2 *(-2*m1-4*m2-4*m3)*g/((-4*m1-3*m2-12*m3)*l1);
K13 = 9/2 * (m2*g)/((-4*m1-3*m2-12*m3)*l1);
K17 = 3/2*(-2*m1-m2-4*m3)/((-4*m1-3*m2-12*m3)*l1);
K22 = 2*g*(m1+2*(m2+m3))/(4*m2*l2-16/9*l2*(m1+3*(m2+m3)));
K23 = -4/3*g*(m1+3*(m2+m3))/(4*m2*l2-16/9*l2*(m1+3*(m2+m3)));
K27 = (2*(m1+2*(m2+m3))-4/3*(m1+3*(m2+m3)))/(4*m2*l2-16/9*l2*(m1+3*(m2+m3)));

%%期望值
x1_ref = 1.5;
x2_ref = 0;
x3_ref = 0;

%%初始值
x1_init = 1;
x2_init = 1;
x3_init = 1;
x4_init = 1;
x5_init = 1;
x6_init = 1;

% 滑模面参数
k1=31.6228;
k2=200.8741;
k3=-315.0325;
k4=28.4588;
k5=3.6153;
k6=-36.2950;

%%滑模控制率参数
%等速趋近率
epsilon = 100;  
%指数趋近率
k_epsilon = 1;  
k_k = 1;
%幂次趋近率
k_mici = 1;
%超螺旋
Kd1_STC = 1;
Kd2_STC = 1;

%%控制限幅
u_up_limit = 200;
u_down_limit = -200;
